# NumberOfUVs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..NumberOfUVs Property
PolymeshTopology Class See Also
---
The number of UV coordinates available for the polymesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfUVs { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfUVs As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfUVs {
	int get ();
}
```

# Remarks
Normally, the number of UV coordinates corresponds to the number of points in a polymesh, but a polymesh does not have to have UVs assigned, in which case the value of this property is 0.
# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace